---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.ColorByObject
source: html/ed321e8f-985e-e4d4-088b-336efab53bef.htm
---
# Autodesk.Revit.DB.Visual.Generic.ColorByObject Property

The property labeled "Color By Object" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string ColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".